# -*- coding: utf-8 -*-
from modules.check import *
import modules.config as con


# monolog №2
def monolog_Trollbots():
    print(con.name + ', хочу познакомить тебя с моим братом...')
    print('Его зовут:')
    print('''
    ▀█▀ █▀▄ ▄▀▀▄ █░░ █░░ █▀▄ ▄▀▀▄ ▀█▀
    ░█░ █▀▄ █░░█ █░░ █░░ █▀▄ █░░█ ░█░
    ░▀░ ▀░▀ ░▀▀░ ▀▀▀ ▀▀▀ ▀▀░ ░▀▀░ ░▀░''')
    print('Именно он будет с тобой играть в режиме trollMod!')
    print('Ему уже не терпиться затроллить тебя...')
    print('Начинаем........')
    exit

# deferents
def d_sandbox():
    con.d = 'песочница'
    print('Выбрана сложность: песочница')
    check_number_for_sandbox()

def d_easy():
    con.d = 'легкая'
    print('Выбрана сложность: легкая')
    print('==============================================================================================')
    print('Правила: я, Numberbot, загадываю число в промежутке [0...10]. А ты, ' + con.name + ' должен его отгадать! У тебя 3 попытки. Подсказки, конечно, будут.')
    print('==============================================================================================')
    print('Начинаем...')
    print('----------------------------------------------------------------------------------------------')
    check_number()

def d_middle():
    con.d = 'средняя'
    print('Выбрана сложность: средная')
    print('==============================================================================================')
    print('Правила: я, Numberbot, загадываю число в промежутке [0...20]. А ты, ' + con.name + ' должен его отгадать! У тебя 3 попытки. Подсказки, конечно, будут.')
    print('==============================================================================================')
    print('Начинаем...')
    print('----------------------------------------------------------------------------------------------')

    check_number()

def d_hard():
    con.d = 'тяжелая'
    print('Выбрана сложность: тяжелая')
    print('==============================================================================================')
    print('Правила: я, Numberbot, загадываю число в промежутке [0...40]. А ты, ' + con.name + ' должен его отгадать! У тебя 3 попытки. Подсказки, конечно, будут.')
    print('==============================================================================================')
    print('Начинаем...')
    print('----------------------------------------------------------------------------------------------')
    check_number()


def d_trollMod():
    con.d = 'trollMod'
    print('Выбрана сложность: trollMod')
    monolog_Trollbots()
    print('==============================================================================================')
    print('Правила: я, Trollbot, загадываю число в промежутке [5...10] А ты, ' + con.name + ' должен его отгадать! Подсказки, конечно, будут. Разрешаю выбрать количество попыток в диапозоне [1...4], т.к., будет не очень честно и долго!!! Не думаю что ты сможешь обыграть!')
    print('==============================================================================================')
    check_count()